[
  {
    "imageUrl": "https://apraditya.github.io/mochfaisalkarim/static/img//local-central-dynamics-and-limitations.jpg",
    "title": "Local-Central Dynamics and Limitations of Micro-Regionalism: Understanding West Kalimantan and Sarawak Cross-Border Cooperation.",
    "pdfUrl": "https://www.academia.edu/16783498/Local-Central_Dynamics_and_Limitations_of_Micro-regionalism_Understanding_West_Kalimantan_and_Sarawak_Cross-Border_Cooperation",
    "intro": "In Balanced Growth for an Inclusive and Equitable ASEAN Community, edited by Mely Caballero-Anthony and Richard Barichello. Singapore: Rajaratnam School of International Studies, Nanyang Technological University, 2015.",
    "description": "Despite increased study of Southeast Asian regionalism, micro-regionalism in Southeast Asia remains comparatively less researched. With the emergence of decentralised states in the region, opportunities have opened up for subnational authorities to play significant roles in the regional integration process, thereby affecting these processes in ways that cannot be underestimated. Taking cross-border cooperation between Indonesia’s West Kalimantan and Malaysia’s Sarawak as case study, this chapter seeks to examine how the dynamics of relations between local and central governments affect the deepening of cross-border cooperation between sub-national authorities, which is the foundation for emergent micro-regionalism. Based largely on interviews from field research in West Kalimantan and Sarawak, this study finds that despite the increased involvement of business actors, existence of cross-border cooperation mechanisms and decentralisation, the emergence of micro-regionalism remains limited between West Kalimantan and Sarawak. Two inter-related inhibiting factors arising from local-central dynamics that hinder further cross-border cooperation between West Kalimantan and Sarawak were identified: (i) defective decentralisation caused by the absence of legal framework, lack of coordination between subnational and central government institutions, and the limited authority given by the central government to the sub-national government, limiting the scope for West Kalimantan to conduct cross-border cooperation with Sarawak; and, (ii) the citing of the sovereignty issue by local elites to attract the attention of the central government to development issues in the border areas, which has caused unintentional deterioration of the relations between West Kalimantan and Sarawak."
  }
]

