[
  {
    "imageUrl": "https://apraditya.github.io/mochfaisalkarim/static/img/asian-journal-of-social-science.jpg",
    "title": "Institutional Dynamics of Regulatory Actors in the Recruitment of Migrant Workers: the Case of Indonesia",
    "intro": "Accepted for Publication in Asian Journal of Social Science 2017",
    "description": "This paper examines how institutional dynamics among regulatory institutions affect the governance of the recruitment of Indonesian migrant workers. Two institutional reforms have been made in the post-authoritarian era namely the establishment of new institution (BNP2TKI) to manage migrant workers and the granting of greater responsibility to sub-national governments to supervise migrant worker recruitment. Despite these institutional reforms, little progress has been made in the protection of Indonesian migrant workers. This paper argues that the establishment of BNP2TKI has created unintended institutional rivalry with the previous institution responsible for the migrant workers governance, the Ministry of Manpower. This institutional rivalry, characterised by the overlapping distribution of responsibility and the conflict over authority, has aggravated the governance of Indonesian migrant workers. Furthermore, Indonesian migrant workers recruitment becomes more complex due to the defective decentralisation caused by the obscure legal framework and the limited authority given to sub-national governments."
  },
  {
    "imageUrl": "https://apraditya.github.io/mochfaisalkarim/static/img/journal-of-international-migration-and-integration.jpg",
    "title": "Integrating European Muslims Through Discourse? Understanding the Development and Limitations of Euro-Islam in Europe",
    "url": "http://dx.doi.org/10.1007/s12134-017-0514-4",
    "pdfUrl": "http://www.mochfaisalkarim.com/uploads/1/0/2/9/102975644/integrating_european_muslims.pdf",
    "intro": "Journal of International Migration and Integration, 2017",
    "description": "This paper examines the dynamics of the development of Euro-Islam as a discourse which offers a modern interpretation of Islam that fits with European context. It investigates how Europe-wide Muslim umbrella organisations promote Euro-Islam discourse while at the same time gain position to represent European Muslims at the European level by mobilising the discourse. Drawing from constructivist literature, this paper argues that Tariq Ramadan’s version of Euro-Islam has been in the stage of socialisation characterised by (1) the existence of network of organisational platforms such as Federation of Islamic Organisation in Europe (FIOE) and Forum of European Muslim Youth and Student Organisations (FEMYSO), (2) the support from supranational actors such as European Parliament and European Commission, and (3) the efforts to codify the discourse through the creation of the Muslims of Europe Charter. However, given the lack of organisational infrastructure to diffuse the discourse due to the diverse nature of Muslim communities in Europe, further internalisation of the discourse has been hindered. Additionally, the connection between Euro-Islam’s organisational platforms with Islamist movement has made the discourse on Euro-Islam being perceived as a camouflage for Islamist agenda. Thus, at this stage, Euro-Islam has become “empty signifier” that are open to continual contestation which serves Muslim umbrella organisations with speaker position to lobby at the European level."
  },
  {
    "imageUrl": "https://apraditya.github.io/mochfaisalkarim/static/img/the-pacific-review.jpg",
    "title": "Role Conflict and the Limits of State Identity: the Case of Indonesia in Democracy Promotion",
    "url": "http://dx.doi.org/10.1080/09512748.2016.1249908",
    "pdfUrl": "http://www.mochfaisalkarim.com/uploads/1/0/2/9/102975644/role_conflict_and_the_limits_of_state_identity_the_case_of_indonesia_in_democracy_promotion.pdf",
    "intro": "the Pacific Review, Vol. 30, No. 3, 2017, p. 385-404.",
    "description": "This paper aims to analyse why Indonesia projects democracy as a state identity by taking on the role of democracy promoter? This paper argues that Indonesia's aspiring role as a democracy promoter is not a manifestation of a firm and coherent democratic political culture, which is more likely to be a permanent feature of states. Thus, rather than seeing it as firmly established state identity, instead, Indonesia's democratic identity should be seen as role conception articulated by foreign policy elites in its quest for international prestige. Its role as a democracy promoter has enabled Indonesia to enhance its other roles conceptions such as a regional leader in Southeast Asia as well as a bridge-builder at the global level. However, this paper further argues that Indonesia's role as a democracy promoter has also been hindered due to the inter-role conflicts arising from its enactment of multiple roles. As a result, Indonesia's enactment of the role as democracy promoter has relatively less impactful towards democratization in the region. To substantiate this argument, the paper examines Indonesia's strategies in promoting democracy and human rights in three case studies, namely Indonesia's role in mainstreaming human rights in ASEAN, Indonesia's democracy promotion through the Bali Democracy Forum, and Indonesia's engagement towards democratization in Myanmar."
  },
  {
    "imageUrl": "https://apraditya.github.io/mochfaisalkarim/static/img/european-journal-of-east-asian-studies.jpg",
    "title": "Waiting for Hard Balancing? Explaining Southeast Asia Balancing Behaviour toward China",
    "url": "http://dx.doi.org/10.1163/15700615-01501002",
    "pdfUrl": "http://www.mochfaisalkarim.com/uploads/1/0/2/9/102975644/waiting_for_hard_balancing.pdf",
    "intro": "European Journal of East Asian Studies Vol. 15, No. 1, 2016, p. 34-61. ",
    "description": "The continuity of stable peace in East Asia, especially Southeast Asia, since the end of the Cold War raises one major question: why is there no apparent balancing behaviour against China, the emerging great power in East Asia? In response to this question, exceptionalists argue that there will be no balancing behaviour against China from Southeast Asian states, while soft balancing theorists argue that the balancing behaviour has already occurred in the form of institutional balancing. This article refutes those arguments and maintains that balancing behaviour is not yet apparent in Southeast Asian balancing, yet it exists in an indirect form. In order to make this argument, this article examines the recent military build-up among Southeast Asian states as well as recent assessments of the ineffectiveness of the Southeast Asian regional security framework. The article also further analyses the conditions under which Southeast Asia’s indirect balancing might turn into hard balancing."
  },
  {
    "imageUrl": "https://apraditya.github.io/mochfaisalkarim/static/img/ceu-political-science-journal.png",
    "title": "How Ethnic Civil War Transforms into Religious Civil War: Evidence from Chechnya",
    "pdfUrl": "https://www.academia.edu/3406410/How_Civil_War_Transforms_into_Religious_Civil_War",
    "intro": "CEU Political Science Journal, Vol. 8, No. 1, 2013, p. 55-79.",
    "description": "​Many studies have proved that civil war in which religion is central issue is bloodier and longer than civil war in which religion is peripheral issue. Yet, few studies try to analyze how religion can transform Ethnic Civil War with religious divides into Religious Civil War, especially when the rebels identify themselves as Muslims. Currently, there are two conventional arguments on factors transforming ethnic civil war into religious civil war: the structural and the mobilization explanation. Using the Chechen war as a case study, this paper finds that the structural explanation failed to explain how ethnic civil war where religion is peripheral issue transforms into religious civil war where religion is central issue. While the mobilization explanation can only partially explain the Chechen civil wars it cannot answer the question how the ethnic civil war turns to religious civil war. The evidence clearly suggests that the involvement of transnational religious actors in the form of foreign fighters is the main factor that transforms ethnic civil war with religious divides into religious civil war."
  }
]
